* Phenology Programs and Scripts

This repository is my attempt to organize some programs and scripts
related to phenology, the study of plant evolution through digital
images. Below you'll find the requirements to make this project useful
for you. All code available here is released under the GPLv3. Feel
free to copy, modify and do whatever you want. Contributions are very
welcomed to improve the robustness or anything else you might find
important. In case of problems, [[https://github.com/schnorr/phenology/issues][report here]]. In all these programs,
=pga= stands for /Phenological Green Average/.

This repository contains the following scripts:

+ =pga_csv=: This program takes as input a path to a directory that
  follows the organization specified below, a mask (JPG) and the
  granularity of the histogram. It prints in the standard output the
  histogram for every image in the CSV file format. This CSV should be
  used with the CPM generation tool, written in R and described
  below. It assumes that the program =pga_hist= is in the PATH.

+ =pga_cpm=: This program takes as input the CSV file created with
  =pga_csv=, a file with the palette (as described below), the low and
  high limit of the histogram bins. It creates as output a
  Chronological Percentage Map (CPM) for each year contained in the
  input, and also an overview with facets. The CPM draws the green
  average histogram as a function of an input image, using stacked
  bars.

This repository contains the following programs:

+ =pga_hist=: This program takes as input three parameters - an image
  (JPG), a mask (JPG) and the granularity of the histogram of pixel's
  green average metric, which is basically =G/(R+G+B)=. The granularity
  tells you the amount of bins in the histogram. The output is one
  line with the count for every bin, separated by comma as in the CSV
  file format. See an example of it in action:

  #+begin_src sh :results output :session :exports both
  pga_hist ./images/tky.jpg ./masks/tky.jpg 20
  #+end_src

  #+RESULTS:
  : 0,0,0,0,0,0,82807,783737,362094,29447,1686,109,11,3,0,0,0,0,0,0

+ =pga_palette=: This program takes as input seven parameters - an image
  (JPG), a mask (JPG), a palette in the file format specified below,
  the lowest and the highest bin identifier to consider, the
  granularity of the histogram and the output image file (that will be
  encoded as JPG in the RGB file format using the colors available in
  the palette). A crucial semantic rule is that the different between
  the high and lowest bin identifiers should be smaller than the
  number of available colors of the palette provided. The program is
  expected to fail otherwise.


